Revit 2027 API
Form.MoveProfile Method
Move a profile of the form, specified by a reference, and an offset vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void MoveProfile(
	int profileIndex,
	XYZ offset
)
Public Sub MoveProfile (
	profileIndex As Integer,
	offset As XYZ
)
public:
void MoveProfile(
	int profileIndex,
	XYZ^ offset
)
member MoveProfile :
        profileIndex : int *
        offset : XYZ -> unit
Parameters
profileIndex Int32
Index to specify the profile.
offset XYZ
 The vector by which the element is to be moved.
Example
public void MoveForm(Form form)
{
    int profileCount = form.ProfileCount;
    if (form.ProfileCount > 0)
    {
        int profileIndex = 0;   // modify the first form only
        if (form.CanManipulateProfile(profileIndex))
        {
            XYZ offset = new XYZ(-25, 0, 0);
            form.MoveProfile(profileIndex, offset);
        }
    }
}
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace